Repository: Unixcision/uniconnect
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, km, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# dock.empty.agentPrompt
source: Set up UniConnect Dock controls for the current context. First, learn the feature before editing: 1. Run `cmux docs dock` if the cmux CLI is available. If it is not, read https://github.com/Unixcision/uniconnect/blob/uniconnect/docs/UNICONNECT.md 2. Inspect the repository or current directory to understand the project type, scripts, package manager, dev servers, logs, task runners, test commands, and any existing TUI tools. 3. If the desired Dock is ambiguous, ask the user what they want monitored or controlled before writing files. Dock is UniConnect's right-sidebar terminal control area. A Dock config is JSON with a top-level `controls` array. Each control runs a command in its own Ghostty-backed terminal section using the user's login shell. Controls are useful for project dashboards, git/status views, dev server or build status, test watchers, log tails, queues, local services, or a custom TUI such as `cmux feed tui --opentui` when that feed is useful. Choose where to write the config: - In a repository or project directory, create or edit `.uniconnect/dock.json` so teammates can share it. - For a personal default outside a repo, create or edit `~/.config/uniconnect/dock.json`. - If both exist, project `.uniconnect/dock.json` is more specific for that project. Nested project configs apply to that directory tree; use the nearest relevant project config instead of writing unrelated controls globally. - If there is no repo and no clear project root, use the global config only after confirming the user wants a personal Dock. Schema: { "controls": [ { "id": "short-stable-id", "title": "Human label", "command": "safe command to run", "cwd": "optional/path", "height": 220, "env": { "NAME": "value" } } ] } Rules: - Keep ids stable, lowercase, and unique. - Use `cwd` for subdirectories; relative paths resolve from the config base. - Use `height` only when a control needs a fixed amount of vertical space. - Use `env` only for non-secret values needed by one control. - Do not put secrets, tokens, or machine-specific private paths in a shared project config. - Prefer commands that are safe to start repeatedly and make sense in a terminal. - Do not invent unavailable scripts. Read package files, Makefiles, Procfiles, README docs, config files, and existing tooling first. - Keep shared project Docks portable for teammates. Put personal or machine-specific controls in the global Dock. Deliverable: - Create or update the appropriate dock.json. - Preserve existing useful controls unless the user asked to replace them. - Validate that the JSON parses. - Summarize what each control does and any commands the user should review before trusting the Dock config.
ar: قم بإعداد UniConnect عناصر تحكم Dock للسياق الحالي. أولاً، تعرف على الميزة قبل التحرير: 1. قم بتشغيل `cmux docs dock` إذا كان cmux CLI متاحًا. إذا لم يكن الأمر كذلك، فاقرأ https://github.com/Unixcision/uniconnect/blob/uniconnect/docs/UNICONNECT.md 2. افحص المستودع أو الدليل الحالي لفهم نوع المشروع والبرامج النصية ومدير الحزم وخوادم التطوير والسجلات وبرامج تشغيل المهام وأوامر الاختبار وأي أدوات TUI موجودة. 3. إذا كان Dock المطلوب غامضًا، فاسأل المستخدم عما يريد مراقبته أو التحكم فيه قبل كتابة الملفات. Dock هو منطقة التحكم الطرفية بالشريط الجانبي الأيمن لـ UniConnect. تكوين Dock هو JSON مع مصفوفة `controls` ذات المستوى الأعلى. يقوم كل عنصر تحكم بتشغيل أمر في قسمه الطرفي المدعوم من Ghostty باستخدام غلاف تسجيل الدخول الخاص بالمستخدم. تعد عناصر التحكم مفيدة للوحات معلومات المشروع، أو طرق عرض git/status، أو خادم التطوير أو حالة البناء، أو مراقبي الاختبار، أو سجلات السجل، أو قوائم الانتظار، أو الخدمات المحلية، أو TUI مخصص مثل `cmux feed tui --opentui` عندما تكون هذه الخلاصة مفيدة. اختر مكان كتابة التكوين: - في مستودع أو دليل مشروع، قم بإنشاء `.uniconnect/dock.json` أو تحريره حتى يتمكن أعضاء الفريق من مشاركته. - بالنسبة إلى الإعداد الافتراضي الشخصي خارج الريبو، قم بإنشاء `~/.config/uniconnect/dock.json` أو تعديله. - إذا كان كلاهما موجودًا، فسيكون المشروع `.uniconnect/dock.json` أكثر تحديدًا لهذا المشروع. تنطبق تكوينات المشروع المتداخلة على شجرة الدليل تلك؛ استخدم أقرب تكوين للمشروع ذي الصلة بدلاً من كتابة عناصر تحكم غير ذات صلة على مستوى العالم. - إذا لم يكن هناك ريبو ولا يوجد مشروع واضح root، استخدم التكوين العام فقط بعد التأكد من أن المستخدم يريد Dock شخصي. مخطط: { "controls": [ { "id": "short-stable-id", "title": "Human label", "command": "safe command to run", "cwd": "optional/path", "height": 220, "env": { "NAME": "value" } } ] } قواعد: - حافظ على معرفات مستقرة وصغيرة وفريدة من نوعها. - استخدم `cwd` للأدلة الفرعية؛ يتم حل المسارات النسبية من قاعدة التكوين. - استخدم `height` فقط عندما يحتاج عنصر التحكم إلى مقدار ثابت من المساحة الرأسية. - استخدم `env` فقط للقيم غير السرية التي يحتاجها عنصر تحكم واحد. - لا تضع أسرارًا أو رموزًا مميزة أو مسارات خاصة خاصة بالجهاز في تكوين مشروع مشترك. - تفضل الأوامر الآمنة للبدء بشكل متكرر وتكون منطقية في الوحدة الطرفية. - لا تخترع البرامج النصية غير المتوفرة. اقرأ ملفات الحزمة وMakefiles وProcfiles وREADME docs وملفات التكوين والأدوات الموجودة أولاً. - احتفظ بـ Docks المشروع المشترك محمولاً لزملائك في الفريق. ضع عناصر تحكم شخصية أو خاصة بالجهاز في Dock العالمي. قابل للتسليم: - قم بإنشاء أو تحديث ملف Dock.json المناسب. - الحفاظ على عناصر التحكم المفيدة الموجودة ما لم يطلب المستخدم استبدالها. - تحقق من أن JSON يوزع. - قم بتلخيص ما يفعله كل عنصر تحكم وأي أوامر يجب على المستخدم مراجعتها قبل الوثوق في تكوين Dock.
bs: Postavite UniConnect Dock kontrole za trenutni kontekst. Prvo naučite funkciju prije uređivanja: 1. Pokrenite `cmux docs dock` ako je dostupan cmux CLI. Ako nije, pročitajte https://github.com/Unixcision/uniconnect/blob/uniconnect/docs/UNICONNECT.md 2. Pregledajte spremište ili trenutni direktorij da biste razumjeli tip projekta, skripte, upravitelj paketa, dev servere, dnevnike, pokretače zadataka, test komande i sve postojeće TUI alate. 3. Ako je željeni Dock dvosmislen, pitajte korisnika šta želi da se nadgleda ili kontroliše prije pisanja datoteka. Dock je kontrolna oblast terminala na desnoj strani UniConnect. Dock konfiguracija je JSON sa nizom `controls` najvišeg nivoa. Svaka kontrola pokreće naredbu u svom terminalskom dijelu koji podržava Ghostty koristeći ljusku za prijavu korisnika. Kontrole su korisne za nadzorne ploče projekta, git/status prikaze, dev server ili status izgradnje, posmatrače testova, zapise dnevnika, redove, lokalne usluge ili prilagođene TUI kao što je `cmux feed tui --opentui` kada je taj feed koristan. Odaberite gdje ćete napisati konfiguraciju: - U spremištu ili direktoriju projekta, kreirajte ili uredite `.uniconnect/dock.json` tako da ga saigrači mogu dijeliti. - Za ličnu zadanu vrijednost izvan repo-a, kreirajte ili uredite `~/.config/uniconnect/dock.json`. - Ako oba postoje, projekat `.uniconnect/dock.json` je specifičniji za taj projekat. Ugniježđene konfiguracije projekta primjenjuju se na to stablo direktorija; koristite najbližu relevantnu konfiguraciju projekta umjesto globalnog pisanja nepovezanih kontrola. - Ako nema repo i jasnog projekta root, koristite globalnu konfiguraciju tek nakon što potvrdite da korisnik želi lični Dock. Shema: { "controls": [ { "id": "short-stable-id", "title": "Human label", "command": "safe command to run", "cwd": "optional/path", "height": 220, "env": { "NAME": "value" } } ] } Pravila: - Održavajte ID-ove stabilnim, malim slovima i jedinstvenim. - Koristite `cwd` za poddirektorije; relativne staze se rješavaju iz baze konfiguracije. - Koristite `height` samo kada je kontroli potrebna fiksna količina vertikalnog prostora. - Koristite `env` samo za netajne vrijednosti koje su potrebne jednoj kontroli. - Nemojte stavljati tajne, tokene ili privatne staze specifične za mašinu u dijeljenu konfiguraciju projekta. - Preferirajte naredbe koje su bezbedne za pokretanje više puta i koje imaju smisla u terminalu. - Nemojte izmišljati nedostupne skripte. Prvo pročitajte datoteke paketa, Makefile, Procfiles, README dokumente, konfiguracijske datoteke i postojeće alate. - Neka dijeljeni projekti Docks budu prenosivi za saigrače. Stavite lične kontrole ili kontrole specifične za mašinu u globalni Dock. Isporučivo: - Kreirajte ili ažurirajte odgovarajući dock.json. - Sačuvajte postojeće korisne kontrole osim ako korisnik zatraži da ih zamijeni. - Potvrdite da JSON analizira. - Sumirajte šta svaka kontrola radi i sve komande koje korisnik treba da pregleda pre nego što veruje u konfiguraciju Dock-a.
da: Konfigurer UniConnect Dock-kontroller til den aktuelle kontekst. Lær først funktionen før redigering: 1. Kør `cmux docs dock`, hvis cmux CLI er tilgængelig. Hvis ikke, læs https://github.com/Unixcision/uniconnect/blob/uniconnect/docs/UNICONNECT.md 2. Undersøg lageret eller det aktuelle bibliotek for at forstå projekttypen, scripts, pakkehåndtering, udviklerservere, logfiler, opgaveløbere, testkommandoer og alle eksisterende TUI værktøjer. 3. Hvis den ønskede Dock er tvetydig, så spørg brugeren, hvad de vil have overvåget eller kontrolleret, før du skriver filer. Dock er cmuxs terminalkontrolområde i højre side. En Dock-konfiguration er JSON med en `controls`-array på øverste niveau. Hver kontrol kører en kommando i sin egen Ghostty-støttede terminalsektion ved hjælp af brugerens login-shell. Kontrolelementer er nyttige til projektdashboards, git/statusvisninger, dev-server- eller buildstatus, testovervågning, loghaler, køer, lokale tjenester eller en tilpasset TUI såsom `cmux feed tui --opentui`, når det feed er nyttigt. Vælg, hvor du vil skrive konfigurationen: - Opret eller rediger `.uniconnect/dock.json` i et lager eller projektmappe, så holdkammerater kan dele det. - For en personlig standard uden for en repo, skal du oprette eller redigere `~/.config/uniconnect/dock.json`. - Hvis begge findes, er projekt `.uniconnect/dock.json` mere specifikt for det pågældende projekt. Indlejrede projektkonfigurationer gælder for det mappetræ; brug den nærmeste relevante projektkonfiguration i stedet for at skrive ikke-relaterede kontroller globalt. - Hvis der ikke er nogen repo og intet klart projekt root, skal du kun bruge den globale konfiguration efter at have bekræftet, at brugeren ønsker en personlig Dock. Skema: { "controls": [ { "id": "short-stable-id", "title": "Human label", "command": "safe command to run", "cwd": "optional/path", "height": 220, "env": { "NAME": "value" } } ] } Regler: - Hold id'er stabile, små bogstaver og unikke. - Brug `cwd` til undermapper; relative stier løses fra konfigurationsbasen. - Brug kun `height`, når en kontrol har brug for en fast mængde lodret plads. - Brug kun `env` til ikke-hemmelige værdier, der kræves af én kontrol. - Læg ikke hemmeligheder, tokens eller maskinspecifikke private stier i en delt projektkonfiguration. - Foretrækker kommandoer, der er sikre at starte gentagne gange og giver mening i en terminal. - Opfind ikke utilgængelige scripts. Læs først pakkefiler, Makefiles, Procfiles, README docs, config-filer og eksisterende værktøjer. - Hold delte projektdokker bærbare for holdkammerater. Sæt personlige eller maskinspecifikke kontroller i den globale Dock. Leveres: - Opret eller opdater den relevante dock.json. - Bevar eksisterende nyttige kontroller, medmindre brugeren har bedt om at erstatte dem. - Bekræft, at JSON parses. - Opsummer, hvad hver kontrol gør, og eventuelle kommandoer, som brugeren skal gennemgå, før han stoler på Dock-konfigurationen.
de: Richten Sie UniConnect Dock-Steuerelemente für den aktuellen Kontext ein. Machen Sie sich zunächst mit der Funktion vertraut, bevor Sie sie bearbeiten: 1. Führen Sie `cmux docs dock` aus, wenn cmux CLI verfügbar ist. Wenn dies nicht der Fall ist, lesen Sie https://github.com/Unixcision/uniconnect/blob/uniconnect/docs/UNICONNECT.md 2. Untersuchen Sie das Repository oder das aktuelle Verzeichnis, um den Projekttyp, die Skripte, den Paketmanager, die Entwicklungsserver, Protokolle, Task-Runner, Testbefehle und alle vorhandenen TUI-Tools zu verstehen. 3. Wenn das gewünschte Dock nicht eindeutig ist, fragen Sie den Benutzer, was er überwachen oder steuern möchte, bevor Sie Dateien schreiben. Dock ist der Terminal-Kontrollbereich in der rechten Seitenleiste von UniConnect. Eine Dock-Konfiguration ist JSON mit einem `controls`-Array der obersten Ebene. Jedes Steuerelement führt einen Befehl in seinem eigenen, von Ghostty unterstützten Terminalabschnitt aus, indem es die Anmeldeshell des Benutzers verwendet. Steuerelemente sind nützlich für Projekt-Dashboards, Git-/Statusansichten, Entwicklungsserver- oder Build-Status, Testbeobachter, Protokollschwänze, Warteschlangen, lokale Dienste oder ein benutzerdefiniertes TUI wie `cmux feed tui --opentui`, wenn dieser Feed nützlich ist. Wählen Sie aus, wo die Konfiguration geschrieben werden soll: - Erstellen oder bearbeiten Sie in einem Repository oder Projektverzeichnis `.uniconnect/dock.json`, damit Teamkollegen es teilen können. - Für einen persönlichen Standard außerhalb eines Repos erstellen oder bearbeiten Sie `~/.config/uniconnect/dock.json`. - Wenn beide vorhanden sind, ist das Projekt `.uniconnect/dock.json` spezifischer für dieses Projekt. Verschachtelte Projektkonfigurationen gelten für diesen Verzeichnisbaum. Verwenden Sie die nächstgelegene relevante Projektkonfiguration, anstatt nicht verwandte Steuerelemente global zu schreiben. - Wenn kein Repo und kein klares Projekt root vorhanden ist, verwenden Sie die globale Konfiguration erst, nachdem Sie bestätigt haben, dass der Benutzer ein persönliches Dock möchte. Schema: { "controls": [ { "id": "short-stable-id", "title": "Human label", "command": "safe command to run", "cwd": "optional/path", "height": 220, "env": { "NAME": "value" } } ] } Regeln: - Halten Sie IDs stabil, kleingeschrieben und eindeutig. - Verwenden Sie `cwd` für Unterverzeichnisse. Relative Pfade werden aus der Konfigurationsbasis aufgelöst. - Verwenden Sie `height` nur, wenn ein Steuerelement einen festen vertikalen Platz benötigt. - Verwenden Sie `env` nur für nicht geheime Werte, die von einem Steuerelement benötigt werden. - Fügen Sie keine Geheimnisse, Token oder maschinenspezifischen privaten Pfade in eine freigegebene Projektkonfiguration ein. - Bevorzugen Sie Befehle, die sicher wiederholt gestartet werden können und in einem Terminal sinnvoll sind. - Erfinden Sie keine nicht verfügbaren Skripte. Lesen Sie zuerst Paketdateien, Makefiles, Procfiles, README-Dokumente, Konfigurationsdateien und vorhandene Tools. - Halten Sie gemeinsam genutzte Projektdocks für Teamkollegen portabel. Platzieren Sie persönliche oder maschinenspezifische Steuerelemente im globalen Dock. Lieferbar: - Erstellen oder aktualisieren Sie die entsprechende dock.json. - Behalten Sie vorhandene nützliche Steuerelemente bei, es sei denn, der Benutzer fordert, sie zu ersetzen. - Überprüfen Sie, ob JSON analysiert wird. - Fassen Sie zusammen, was jedes Steuerelement bewirkt und welche Befehle der Benutzer überprüfen sollte, bevor er der Dock-Konfiguration vertraut.
es: Configura los controles del Dock de UniConnect para el contexto actual. Primero, entiende la función antes de editar: 1. Ejecuta `cmux docs dock` si la CLI de UniConnect está disponible. Si no lo está, lee https://github.com/Unixcision/uniconnect/blob/uniconnect/docs/UNICONNECT.md 2. Inspecciona el repositorio o el directorio actual para entender el tipo de proyecto, los scripts, el gestor de paquetes, los servidores de desarrollo, los registros, los ejecutores de tareas, los comandos de prueba y cualquier herramienta TUI existente. 3. Si el Dock deseado no está claro, pregunta al usuario qué quiere supervisar o controlar antes de escribir archivos. Dock es el área de controles de terminal de la barra lateral derecha de UniConnect. Una configuración de Dock es un archivo JSON con un array `controls` en el nivel superior. Cada control ejecuta un comando en su propia sección de terminal basada en Ghostty usando el shell de inicio de sesión del usuario. Los controles sirven para paneles de proyecto, vistas de git/status, estado de servidores de desarrollo o compilaciones, observadores de pruebas, colas de registros, colas de trabajo, servicios locales o una TUI personalizada como `cmux feed tui --opentui` cuando ese feed resulte útil. Elige dónde guardar la configuración: - En un repositorio o directorio de proyecto, crea o edita `.uniconnect/dock.json` para compartirlo con el equipo. - Para una configuración personal predeterminada fuera de un repositorio, crea o edita `~/.config/uniconnect/dock.json`. - Si existen ambos, el archivo `.uniconnect/dock.json` del proyecto es el más específico. Las configuraciones anidadas se aplican a su árbol de directorios; usa la configuración de proyecto pertinente más cercana en vez de escribir controles no relacionados de forma global. - Si no hay repositorio ni una raíz de proyecto clara, usa la configuración global solo después de confirmar que el usuario quiere un Dock personal. Esquema: { "controls": [ { "id": "short-stable-id", "title": "Human label", "command": "safe command to run", "cwd": "optional/path", "height": 220, "env": { "NAME": "value" } } ] } Reglas: - Mantén los identificadores estables, en minúsculas y únicos. - Usa `cwd` para subdirectorios; las rutas relativas se resuelven desde la base de la configuración. - Usa `height` solo cuando un control necesite una altura vertical fija. - Usa `env` solo para valores no secretos necesarios para un control. - No incluyas secretos, tokens ni rutas privadas específicas de una máquina en una configuración de proyecto compartida. - Prefiere comandos que puedan iniciarse repetidamente de forma segura y que tengan sentido en una terminal. - No inventes scripts que no existan. Lee primero los archivos de paquetes, Makefiles, Procfiles, README, archivos de configuración y herramientas existentes. - Mantén portátiles para el equipo los Docks compartidos del proyecto. Coloca los controles personales o específicos de una máquina en el Dock global. Entrega: - Crea o actualiza el archivo dock.json adecuado. - Conserva los controles útiles existentes salvo que el usuario pida reemplazarlos. - Valida que el JSON se pueda analizar. - Resume qué hace cada control y qué comandos debe revisar el usuario antes de confiar en la configuración del Dock.
fr: Configurez les contrôles Dock UniConnect pour le contexte actuel. Tout d’abord, apprenez la fonctionnalité avant de la modifier: 1. Exécutez `cmux docs dock` si le cmux CLI est disponible. Si ce n'est pas le cas, lisez https://github.com/Unixcision/uniconnect/blob/uniconnect/docs/UNICONNECT.md 2. Inspectez le référentiel ou le répertoire actuel pour comprendre le type de projet, les scripts, le gestionnaire de packages, les serveurs de développement, les journaux, les exécuteurs de tâches, les commandes de test et tous les outils TUI existants. 3. Si le Dock souhaité est ambigu, demandez à l'utilisateur ce qu'il souhaite surveiller ou contrôler avant d'écrire des fichiers. Dock est la zone de contrôle du terminal de la barre latérale droite de UniConnect. Une configuration Dock est JSON avec un tableau `controls` de niveau supérieur. Chaque contrôle exécute une commande dans sa propre section de terminal basée sur Ghostty à l'aide du shell de connexion de l'utilisateur. Les contrôles sont utiles pour les tableaux de bord de projet, les vues git/status, l'état du serveur de développement ou de la build, les observateurs de tests, les queues de journal, les files d'attente, les services locaux ou un TUI personnalisé tel que `cmux feed tui --opentui` lorsque ce flux est utile. Choisissez où écrire la configuration: - Dans un référentiel ou un répertoire de projet, créez ou modifiez `.uniconnect/dock.json` afin que vos coéquipiers puissent le partager. - Pour un défaut personnel en dehors d'un dépôt, créez ou modifiez `~/.config/uniconnect/dock.json`. - Si les deux existent, le projet `.uniconnect/dock.json` est plus spécifique à ce projet. Les configurations de projet imbriquées s'appliquent à cette arborescence de répertoires ; utilisez la configuration de projet pertinente la plus proche au lieu d'écrire des contrôles sans rapport globalement. - S'il n'y a pas de dépôt ni de projet clair root, utilisez la configuration globale uniquement après avoir confirmé que l'utilisateur souhaite un Dock personnel. Schéma: { "controls": [ { "id": "short-stable-id", "title": "Human label", "command": "safe command to run", "cwd": "optional/path", "height": 220, "env": { "NAME": "value" } } ] } Règles: - Gardez les identifiants stables, en minuscules et uniques. - Utilisez `cwd` pour les sous-répertoires ; les chemins relatifs sont résolus à partir de la base de configuration. - Utilisez `height` uniquement lorsqu'un contrôle nécessite une quantité fixe d'espace vertical. - Utilisez `env` uniquement pour les valeurs non secrètes nécessaires à un contrôle. - Ne placez pas de secrets, de jetons ou de chemins privés spécifiques à une machine dans une configuration de projet partagée. - Préférez les commandes qui peuvent être démarrées à plusieurs reprises en toute sécurité et qui ont du sens dans un terminal. - N'inventez pas de scripts indisponibles. Lisez d'abord les fichiers de package, les Makefiles, les Procfiles, les documents README, les fichiers de configuration et les outils existants. - Gardez les Docks de projets partagés portables pour les coéquipiers. Placez les contrôles personnels ou spécifiques à la machine dans le Dock global. Livrable: - Créez ou mettez à jour le dock.json approprié. - Conservez les contrôles utiles existants à moins que l’utilisateur ne demande de les remplacer. - Vérifiez que JSON analyse. - Résumez ce que fait chaque contrôle et toutes les commandes que l'utilisateur doit examiner avant de faire confiance à la configuration du Dock.
it: Configura UniConnect Controlli Dock per il contesto corrente. Innanzitutto, impara la funzionalità prima di modificarla: 1. Esegui `cmux docs dock` se cmux CLI è disponibile. In caso contrario, leggi https://github.com/Unixcision/uniconnect/blob/uniconnect/docs/UNICONNECT.md 2. Ispeziona il repository o la directory corrente per comprendere il tipo di progetto, gli script, il gestore pacchetti, i server di sviluppo, i log, i task runner, i comandi di test e qualsiasi strumento TUI esistente. 3. Se il Dock desiderato è ambiguo, chiedi all'utente cosa desidera monitorare o controllare prima di scrivere i file. Il Dock è l'area di controllo del terminale della barra laterale destra di UniConnect. Una configurazione Dock è JSON con un array `controls` di primo livello. Ogni controllo esegue un comando nella propria sezione terminale supportata da Ghostty utilizzando la shell di accesso dell'utente. I controlli sono utili per dashboard di progetto, visualizzazioni git/status, stato del server di sviluppo o build, osservatori di test, code di log, code, servizi locali o un TUI personalizzato come `cmux feed tui --opentui` quando il feed è utile. Scegli dove scrivere la configurazione: - In un repository o in una directory di progetto, crea o modifica `.uniconnect/dock.json` in modo che i compagni di squadra possano condividerlo. - Per un'impostazione predefinita personale esterna a un repository, crea o modifica `~/.config/uniconnect/dock.json`. - Se esistono entrambi, il progetto `.uniconnect/dock.json` è più specifico per quel progetto. Le configurazioni di progetto nidificate si applicano a quell'albero di directory; utilizzare la configurazione di progetto pertinente più vicina invece di scrivere controlli non correlati a livello globale. - Se non sono presenti repository e progetti chiari root, utilizzare la configurazione globale solo dopo aver confermato che l'utente desidera un Dock personale. Schema: { "controls": [ { "id": "short-stable-id", "title": "Human label", "command": "safe command to run", "cwd": "optional/path", "height": 220, "env": { "NAME": "value" } } ] } Regole: - Mantieni gli ID stabili, in minuscolo e univoci. - Utilizzare `cwd` per le sottodirectory; i percorsi relativi vengono risolti dalla base di configurazione. - Utilizza `height` solo quando un controllo necessita di una quantità fissa di spazio verticale. - Utilizzare `env` solo per i valori non segreti necessari a un controllo. - Non inserire segreti, token o percorsi privati ​​specifici del computer in una configurazione di progetto condivisa. - Preferire comandi che siano sicuri da avviare ripetutamente e che abbiano senso in un terminale. - Non inventare script non disponibili. Leggi prima i file del pacchetto, Makefile, Procfile, la documentazione README, i file di configurazione e gli strumenti esistenti. - Mantieni i Dock dei progetti condivisi portatili per i compagni di squadra. Inserisci controlli personali o specifici della macchina nel Dock globale. Consegnabile: - Crea o aggiorna il dock.json appropriato. - Conserva i controlli utili esistenti a meno che l'utente non chieda di sostituirli. - Convalidare che JSON analizzi. - Riepilogare cosa fa ogni controllo e tutti i comandi che l'utente dovrebbe rivedere prima di fidarsi della configurazione del Dock.
ja: 現在のコンテキストの UniConnect ドック コントロールをセットアップします。 編集する前にまず機能を学習してください: 1. cmux CLI が使用可能な場合は、`cmux docs dock` を実行します。そうでない場合は、https://github.com/Unixcision/uniconnect/blob/uniconnect/docs/UNICONNECT.md をお読みください。 2. リポジトリまたは現在のディレクトリを調べて、プロジェクト タイプ、スクリプト、パッケージ マネージャー、開発サーバー、ログ、タスク ランナー、テスト コマンド、および既存の TUI ツールを理解します。 3. 目的の Dock があいまいな場合は、ファイルを書き込む前に、何を監視または制御したいかをユーザーに尋ねます。 Dock は UniConnect の右側のサイドバーのターミナル コントロール領域です。 Dock 構成は JSON で、トップレベルの配列は `controls` です。各コントロールは、ユーザーのログイン シェルを使用して、Ghostty がサポートする独自のターミナル セクションでコマンドを実行します。コントロールは、プロジェクト ダッシュボード、git/status ビュー、開発サーバーまたはビルド ステータス、テスト ウォッチャー、ログ テール、キュー、ローカル サービス、またはフィードが役立つ場合の `cmux feed tui --opentui` などのカスタム TUI に役立ちます。 設定を書き込む場所を選択する: - リポジトリまたはプロジェクト ディレクトリで、チームメイトが共有できるように `.uniconnect/dock.json` を作成または編集します。 - リポジトリ外の個人用デフォルトの場合は、`~/.config/uniconnect/dock.json` を作成または編集します。 - 両方が存在する場合、プロジェクト `.uniconnect/dock.json` の方がそのプロジェクトに特化しています。ネストされたプロジェクト構成はそのディレクトリ ツリーに適用されます。無関係なコントロールをグローバルに記述する代わりに、最も近い関連するプロジェクト構成を使用します。 - リポジトリがなく、明確なプロジェクト root がない場合は、ユーザーが個人用 Dock を望んでいることを確認した後でのみグローバル構成を使用してください。 スキーマ: { "controls": [ { "id": "short-stable-id", "title": "Human label", "command": "safe command to run", "cwd": "optional/path", "height": 220, "env": { "NAME": "value" } } ] } ルール: - ID は安定し、小文字で一意であるようにしてください。 - サブディレクトリには `cwd` を使用します。相対パスは構成ベースから解決されます。 - `height` は、コントロールに一定量の垂直スペースが必要な場合にのみ使用してください。 - `env` は、1 つのコントロールで必要な非シークレット値にのみ使用してください。 - 共有プロジェクト構成にシークレット、トークン、またはマシン固有のプライベート パスを入れないでください。 - 繰り返し起動しても安全で、ターミナルで意味をなすコマンドを優先します。 - 利用できないスクリプトを作成しないでください。最初に、パッケージ ファイル、Makefile、Procfile、README ドキュメント、構成ファイル、および既存のツールを読みます。 - 共有プロジェクト ドックをチームメイトが持ち運びできるようにします。個人またはマシン固有のコントロールをグローバル Dock に配置します。 成果物: - 適切な dock.json を作成または更新します。 - ユーザーが置き換えを要求しない限り、既存の便利なコントロールを保持します。 - JSON が解析されることを検証します。 - 各コントロールの機能と、Dock 構成を信頼する前にユーザーが確認する必要があるコマンドをまとめます。
km: ដំឡើង UniConnect Dock controls សម្រាប់បរិបទបច្ចុប្បន្ន។ ជាដំបូង សិក្សាពីលក្ខណៈពិសេសមុននឹងកែសម្រួល: 1. ដំណើរការ `cmux docs dock` ប្រសិនបើ cmux CLI មាន។ ប្រសិនបើវាមិនមែនទេ សូមអាន https://github.com/Unixcision/uniconnect/blob/uniconnect/docs/UNICONNECT.md 2. ពិនិត្យមើលឃ្លាំង ឬថតបច្ចុប្បន្ន ដើម្បីយល់អំពីប្រភេទគម្រោង ស្គ្រីប កម្មវិធីគ្រប់គ្រងកញ្ចប់ ឧបករណ៍ម៉ាស៊ីនមេ កំណត់ហេតុ អ្នករត់ភារកិច្ច ពាក្យបញ្ជាសាកល្បង និងឧបករណ៍ TUI ដែលមានស្រាប់ណាមួយ។ 3. ប្រសិនបើ Dock ដែលចង់បានមានភាពមិនច្បាស់លាស់ សូមសួរអ្នកប្រើប្រាស់នូវអ្វីដែលពួកគេចង់ត្រួតពិនិត្យ ឬគ្រប់គ្រងមុនពេលសរសេរឯកសារ។ Dock គឺ UniConnect's right-side-side control terminal control area. ការកំណត់រចនាសម្ព័ន្ធ Dock គឺ JSON ជាមួយនឹងកម្រិតកំពូល `controls` អារេ។ វត្ថុបញ្ជានីមួយៗដំណើរការពាក្យបញ្ជានៅក្នុងផ្នែកស្ថានីយដែលគាំទ្រដោយ Ghostty ផ្ទាល់របស់វា ដោយប្រើសែលចូលរបស់អ្នកប្រើ។ ការគ្រប់គ្រងមានប្រយោជន៍សម្រាប់ផ្ទាំងគ្រប់គ្រងគម្រោង ការមើល git/status server ឬបង្កើតស្ថានភាព អ្នកមើលសាកល្បង កន្ទុយកំណត់ហេតុ ជួរ សេវាកម្មមូលដ្ឋាន ឬ TUI ផ្ទាល់ខ្លួនដូចជា `cmux feed tui --opentui` នៅពេលដែលព័ត៌មាននោះមានប្រយោជន៍។ ជ្រើសរើសកន្លែងដែលត្រូវសរសេរការកំណត់: - នៅក្នុងឃ្លាំង ឬថតគម្រោង បង្កើត ឬកែសម្រួល `.uniconnect/dock.json` ដូច្នេះមិត្តរួមក្រុមអាចចែករំលែកវាបាន។ - សម្រាប់លំនាំដើមផ្ទាល់ខ្លួននៅខាងក្រៅ repo បង្កើត ឬកែសម្រួល `~/.config/uniconnect/dock.json`។ - ប្រសិនបើមានទាំងពីរ គម្រោង `.uniconnect/dock.json` គឺកាន់តែជាក់លាក់សម្រាប់គម្រោងនោះ។ ការកំណត់រចនាសម្ព័ន្ធគម្រោង Nested អនុវត្តចំពោះមែកធាងថតនោះ។ ប្រើការកំណត់រចនាសម្ព័ន្ធគម្រោងដែលនៅជិតបំផុតជំនួសឱ្យការសរសេរការគ្រប់គ្រងដែលមិនទាក់ទងជាសកល។ - ប្រសិនបើមិនមាន repo និងមិនមានគម្រោងច្បាស់លាស់ root ប្រើការកំណត់សកលបន្ទាប់ពីបញ្ជាក់ថាអ្នកប្រើប្រាស់ចង់បាន Dock ផ្ទាល់ខ្លួន។ គ្រោងការណ៍: { "controls": [ { "id": "short-stable-id", "title": "Human label", "command": "safe command to run", "cwd": "optional/path", "height": 220, "env": { "NAME": "value" } } ] } ច្បាប់: - រក្សាលេខសម្គាល់ឱ្យស្ថិតស្ថេរ អក្សរតូច និងតែមួយគត់។ - ប្រើ `cwd` សម្រាប់ថតរង; ផ្លូវដែលទាក់ទងដោះស្រាយពីមូលដ្ឋានកំណត់រចនាសម្ព័ន្ធ។ - ប្រើ `height` តែនៅពេលដែលវត្ថុបញ្ជាត្រូវការចំនួនថេរនៃទំហំបញ្ឈរ។ - ប្រើ `env` សម្រាប់តែតម្លៃដែលមិនមែនជាសម្ងាត់ដែលត្រូវការដោយវត្ថុបញ្ជាមួយ។ - កុំដាក់អាថ៌កំបាំង សញ្ញាសម្ងាត់ ឬផ្លូវឯកជនជាក់លាក់របស់ម៉ាស៊ីននៅក្នុងការកំណត់រចនាសម្ព័ន្ធគម្រោងដែលបានចែករំលែក។ - ចូលចិត្ត​ពាក្យ​បញ្ជា​ដែល​មាន​សុវត្ថិភាព​ក្នុង​ការ​ចាប់​ផ្តើម​ម្តង​ហើយ​ម្តង​ទៀត​និង​មាន​ន័យ​ក្នុង​ស្ថានីយ។ - កុំបង្កើតស្គ្រីបដែលមិនអាចប្រើបាន។ អានឯកសារកញ្ចប់ Makefiles Procfiles README ឯកសារ ឯកសារកំណត់រចនាសម្ព័ន្ធ និងឧបករណ៍ដែលមានស្រាប់ជាមុនសិន។ - រក្សាគម្រោងដែលបានចែករំលែក Docks ចល័តសម្រាប់មិត្តរួមក្រុម។ ដាក់ការគ្រប់គ្រងផ្ទាល់ខ្លួន ឬម៉ាស៊ីនជាក់លាក់នៅក្នុង Dock សកល។ អាចដឹកជញ្ជូនបាន។: - បង្កើត ឬធ្វើបច្ចុប្បន្នភាព dock.json ដែលសមស្រប។ - រក្សាការគ្រប់គ្រងដែលមានប្រយោជន៍ដែលមានស្រាប់ លុះត្រាតែអ្នកប្រើប្រាស់បានស្នើសុំឱ្យជំនួសពួកគេ។ - ធ្វើឱ្យមានសុពលភាពថាការញែក JSON ។ - សង្ខេបនូវអ្វីដែលការគ្រប់គ្រងនីមួយៗធ្វើ និងពាក្យបញ្ជាណាមួយដែលអ្នកប្រើប្រាស់គួរតែពិនិត្យមើលមុននឹងជឿជាក់លើការកំណត់ Dock ។
ko: 현재 컨텍스트에 대해 UniConnect Dock 컨트롤을 설정합니다. 편집하기 전에 먼저 기능을 익히세요.: 1. cmux CLI을 사용할 수 있는 경우 `cmux docs dock`을 실행합니다. 그렇지 않은 경우 https://github.com/Unixcision/uniconnect/blob/uniconnect/docs/UNICONNECT.md을 읽어보세요. 2. 프로젝트 유형, 스크립트, 패키지 관리자, 개발 서버, 로그, 작업 실행기, 테스트 명령 및 기존 TUI 도구를 이해하려면 저장소 또는 현재 디렉터리를 검사하세요. 3. 원하는 Dock이 모호한 경우 파일을 쓰기 전에 사용자에게 무엇을 모니터링하거나 제어하고 싶은지 물어보세요. Dock은 UniConnect의 오른쪽 사이드바 터미널 제어 영역입니다. Dock 구성은 최상위 `controls` 배열이 있는 JSON입니다. 각 컨트롤은 사용자의 로그인 쉘을 사용하여 자체 Ghostty 지원 터미널 섹션에서 명령을 실행합니다. 컨트롤은 프로젝트 대시보드, git/상태 보기, 개발 서버 또는 빌드 상태, 테스트 감시자, 로그 테일, 대기열, 로컬 서비스 또는 해당 피드가 유용한 경우 `cmux feed tui --opentui`과 같은 사용자 정의 TUI에 유용합니다. 구성을 작성할 위치를 선택하세요.: - 저장소 또는 프로젝트 디렉터리에서 팀원이 공유할 수 있도록 `.uniconnect/dock.json`을 생성하거나 편집합니다. - 저장소 외부의 개인 기본값의 경우 `~/.config/uniconnect/dock.json`을 생성하거나 편집하세요. - 둘 다 존재하는 경우 `.uniconnect/dock.json` 프로젝트가 해당 프로젝트에 더 구체적입니다. 중첩된 프로젝트 구성은 해당 디렉터리 트리에 적용됩니다. 관련 없는 컨트롤을 전역적으로 작성하는 대신 가장 가까운 관련 프로젝트 구성을 사용하세요. - 저장소가 없고 명확한 프로젝트 root이 없는 경우 사용자가 개인 Dock을 원한다는 것을 확인한 후에만 전역 구성을 사용하십시오. 개요: { "controls": [ { "id": "short-stable-id", "title": "Human label", "command": "safe command to run", "cwd": "optional/path", "height": 220, "env": { "NAME": "value" } } ] } 규칙: - ID를 안정적이고 소문자로 고유하게 유지하세요. - 하위 디렉터리에는 `cwd`을 사용하세요. 상대 경로는 구성 기반에서 확인됩니다. - 컨트롤에 고정된 수직 공간이 필요한 경우에만 `height`을 사용하세요. - 하나의 컨트롤에 필요한 비밀이 아닌 값에만 `env`을 사용하세요. - 공유 프로젝트 구성에 비밀, 토큰 또는 컴퓨터별 개인 경로를 넣지 마세요. - 반복해서 시작해도 안전하고 터미널에서 의미가 있는 명령을 선호하세요. - 사용할 수 없는 스크립트를 만들지 마세요. 패키지 파일, Makefiles, Procfiles, README 문서, 구성 파일 및 기존 도구를 먼저 읽으십시오. - 팀원을 위해 공유 프로젝트 Dock을 휴대 가능하게 유지하세요. 글로벌 Dock에 개인용 또는 기계별 제어 기능을 추가하세요. 결과물: - 적절한 Dock.json을 생성하거나 업데이트합니다. - 사용자가 교체를 요청하지 않는 한 기존의 유용한 컨트롤을 유지합니다. - JSON이 구문 분석되는지 확인합니다. - Dock 구성을 신뢰하기 전에 사용자가 검토해야 하는 각 컨트롤의 기능과 명령을 요약합니다.
nb: Konfigurer UniConnect Dock-kontroller for gjeldende kontekst. Lær først funksjonen før du redigerer: 1. Kjør `cmux docs dock` hvis cmux CLI er tilgjengelig. Hvis den ikke er det, les https://github.com/Unixcision/uniconnect/blob/uniconnect/docs/UNICONNECT.md 2. Inspiser depotet eller gjeldende katalog for å forstå prosjekttypen, skriptene, pakkebehandlingen, dev-servere, logger, oppgaveløpere, testkommandoer og eventuelle eksisterende TUI-verktøy. 3. Hvis ønsket Dock er tvetydig, spør brukeren hva de vil ha overvåket eller kontrollert før du skriver filer. Dock er cmuxs terminalkontrollområde på høyre sidefelt. En Dock-konfigurasjon er JSON med en `controls`-matrise på toppnivå. Hver kontroll kjører en kommando i sin egen Ghostty-støttede terminalseksjon ved å bruke brukerens påloggingsskall. Kontroller er nyttige for prosjektdashboards, git/statusvisninger, utviklerserver- eller byggestatus, testovervåkere, logghaler, køer, lokale tjenester eller en tilpasset TUI som `cmux feed tui --opentui` når den feeden er nyttig. Velg hvor du vil skrive konfigurasjonen: - Opprett eller rediger `.uniconnect/dock.json` i et depot eller prosjektkatalog slik at lagkamerater kan dele det. - For en personlig standard utenfor en repo, opprett eller rediger `~/.config/uniconnect/dock.json`. - Hvis begge finnes, er prosjektet `.uniconnect/dock.json` mer spesifikt for det prosjektet. Nestede prosjektkonfigurasjoner gjelder for det katalogtreet; bruk nærmeste relevante prosjektkonfigurasjon i stedet for å skrive urelaterte kontroller globalt. - Hvis det ikke er noen repo og ikke noe klart prosjekt root, bruk den globale konfigurasjonen bare etter å ha bekreftet at brukeren ønsker en personlig Dock. Skjema: { "controls": [ { "id": "short-stable-id", "title": "Human label", "command": "safe command to run", "cwd": "optional/path", "height": 220, "env": { "NAME": "value" } } ] } Regler: - Hold ID stabile, små bokstaver og unike. - Bruk `cwd` for underkataloger; relative baner løses fra konfigurasjonsbasen. - Bruk `height` bare når en kontroll trenger en fast mengde vertikal plass. - Bruk `env` bare for ikke-hemmelige verdier som kreves av én kontroll. - Ikke legg hemmeligheter, tokens eller maskinspesifikke private baner i en delt prosjektkonfigurasjon. - Foretrekk kommandoer som er trygge å starte gjentatte ganger og gir mening i en terminal. - Ikke oppfinn utilgjengelige skript. Les først pakkefiler, Makefiles, Procfiles, README dokumenter, konfigurasjonsfiler og eksisterende verktøy. - Hold delte prosjektdokker bærbare for lagkamerater. Sett personlige eller maskinspesifikke kontroller i den globale Dock. Leveres: - Opprett eller oppdater riktig dock.json. - Behold eksisterende nyttige kontroller med mindre brukeren ba om å erstatte dem. - Bekreft at JSON analyserer. - Oppsummer hva hver kontroll gjør og eventuelle kommandoer brukeren bør gjennomgå før han stoler på Dock-konfigurasjonen.
pl: Skonfiguruj UniConnect Elementy sterujące Docku dla bieżącego kontekstu. Najpierw zapoznaj się z funkcją przed edycją: 1. Uruchom `cmux docs dock`, jeśli dostępny jest cmux CLI. Jeśli tak nie jest, przeczytaj https://github.com/Unixcision/uniconnect/blob/uniconnect/docs/UNICONNECT.md 2. Sprawdź repozytorium lub katalog bieżący, aby poznać typ projektu, skrypty, menedżera pakietów, serwery deweloperskie, dzienniki, programy uruchamiające zadania, polecenia testowe i wszelkie istniejące narzędzia TUI. 3. Jeśli żądany Dock jest niejednoznaczny, przed zapisaniem plików zapytaj użytkownika, co chce monitorować lub kontrolować. Dok to obszar kontrolny terminala znajdujący się na prawym pasku bocznym UniConnect. Konfiguracja Docka to JSON z tablicą `controls` najwyższego poziomu. Każdy element sterujący uruchamia polecenie we własnej sekcji terminala obsługiwanej przez Ghostty, korzystając z powłoki logowania użytkownika. Kontrole są przydatne w przypadku pulpitów nawigacyjnych projektu, widoków git/status, stanu serwera deweloperskiego lub kompilacji, obserwatorów testów, końcówek dziennika, kolejek, usług lokalnych lub niestandardowego TUI, takiego jak `cmux feed tui --opentui`, gdy ten kanał jest przydatny. Wybierz miejsce zapisania konfiguracji: - W repozytorium lub katalogu projektu utwórz lub edytuj `.uniconnect/dock.json`, aby członkowie zespołu mogli go udostępnić. - Aby ustawić ustawienie domyślne poza repozytorium, utwórz lub edytuj `~/.config/uniconnect/dock.json`. - Jeśli oba istnieją, projekt `.uniconnect/dock.json` jest bardziej szczegółowy dla tego projektu. Zagnieżdżone konfiguracje projektu mają zastosowanie do tego drzewa katalogów; użyj najbliższej odpowiedniej konfiguracji projektu zamiast pisać niepowiązane kontrolki globalnie. - Jeśli nie ma repozytorium ani przejrzystego projektu root, użyj konfiguracji globalnej dopiero po potwierdzeniu, że użytkownik chce osobistego Docka. Schemat: { "controls": [ { "id": "short-stable-id", "title": "Human label", "command": "safe command to run", "cwd": "optional/path", "height": 220, "env": { "NAME": "value" } } ] } Zasady: - Zachowaj stabilne identyfikatory, małe litery i unikalne. - Użyj `cwd` dla podkatalogów; ścieżki względne są rozpoznawane z bazy konfiguracji. - Użyj `height` tylko wtedy, gdy formant potrzebuje stałej ilości miejsca w pionie. - Użyj `env` tylko w przypadku nietajnych wartości wymaganych przez jedną kontrolkę. - Nie umieszczaj wpisów tajnych, tokenów ani ścieżek prywatnych specyficznych dla komputera we udostępnionej konfiguracji projektu. - Preferuj polecenia, które można bezpiecznie uruchamiać wielokrotnie i które mają sens w terminalu. - Nie wymyślaj niedostępnych skryptów. Najpierw przeczytaj pliki pakietów, pliki Makefile, Procfiles, README docs, pliki konfiguracyjne i istniejące narzędzia. - Przechowuj udostępnione doki projektowe jako przenośne dla członków zespołu. Umieść elementy sterujące osobiste lub specyficzne dla maszyny w globalnym Docku. Możliwość dostarczenia: - Utwórz lub zaktualizuj odpowiedni plik dock.json. - Zachowaj istniejące przydatne elementy sterujące, chyba że użytkownik poprosił o ich wymianę. - Sprawdź, czy JSON analizuje. - Podsumuj działanie każdej kontrolki i wszelkie polecenia, które użytkownik powinien przejrzeć, zanim zaufa konfiguracji Docka.
pt_br: Configure UniConnect controles do Dock para o contexto atual. Primeiro, aprenda o recurso antes de editar: 1. Execute `cmux docs dock` se cmux CLI estiver disponível. Caso contrário, leia https://github.com/Unixcision/uniconnect/blob/uniconnect/docs/UNICONNECT.md 2. Inspecione o repositório ou diretório atual para entender o tipo de projeto, scripts, gerenciador de pacotes, servidores de desenvolvimento, logs, executores de tarefas, comandos de teste e quaisquer ferramentas TUI existentes. 3. Se o Dock desejado for ambíguo, pergunte ao usuário o que ele deseja monitorar ou controlar antes de gravar os arquivos. Dock é a área de controle do terminal da barra lateral direita de UniConnect. Uma configuração do Dock é JSON com uma matriz `controls` de nível superior. Cada controle executa um comando em sua própria seção de terminal apoiada pelo Ghostty usando o shell de login do usuário. Os controles são úteis para painéis de projeto, visualizações de git/status, servidor de desenvolvimento ou status de compilação, observadores de teste, log tails, filas, serviços locais ou um TUI personalizado, como `cmux feed tui --opentui` quando esse feed é útil. Escolha onde escrever a configuração: - Em um repositório ou diretório de projeto, crie ou edite `.uniconnect/dock.json` para que colegas de equipe possam compartilhá-lo. - Para um padrão pessoal fora de um repositório, crie ou edite `~/.config/uniconnect/dock.json`. - Se ambos existirem, o projeto `.uniconnect/dock.json` é mais específico para esse projeto. As configurações de projeto aninhadas se aplicam a essa árvore de diretórios; use a configuração de projeto relevante mais próxima em vez de escrever controles não relacionados globalmente. - Se não houver repositório e nenhum projeto claro root, use a configuração global somente após confirmar que o usuário deseja um Dock pessoal. Esquema: { "controls": [ { "id": "short-stable-id", "title": "Human label", "command": "safe command to run", "cwd": "optional/path", "height": 220, "env": { "NAME": "value" } } ] } Regras: - Mantenha os IDs estáveis, minúsculos e exclusivos. - Use `cwd` para subdiretórios; caminhos relativos são resolvidos a partir da base de configuração. - Use `height` somente quando um controle precisar de uma quantidade fixa de espaço vertical. - Use `env` apenas para valores não secretos necessários para um controle. - Não coloque segredos, tokens ou caminhos privados específicos da máquina em uma configuração de projeto compartilhada. - Prefira comandos que sejam seguros para serem iniciados repetidamente e que façam sentido em um terminal. - Não invente scripts indisponíveis. Leia primeiro os arquivos de pacote, Makefiles, Procfiles, README documentos, arquivos de configuração e ferramentas existentes. - Mantenha os Docks de projetos compartilhados portáteis para colegas de equipe. Coloque controles pessoais ou específicos da máquina no Dock global. Entregável: - Crie ou atualize o dock.json apropriado. - Preservar os controles úteis existentes, a menos que o usuário solicite sua substituição. - Valide que JSON analisa. - Resuma o que cada controle faz e quaisquer comandos que o usuário deve revisar antes de confiar na configuração do Dock.
ru: Настройте UniConnect элементы управления Dock для текущего контекста. Прежде чем редактировать, изучите эту функцию.: 1. Запустите `cmux docs dock`, если cmux CLI доступен. Если это не так, прочитайте https://github.com/Unixcision/uniconnect/blob/uniconnect/docs/UNICONNECT.md. 2. Проверьте репозиторий или текущий каталог, чтобы понять тип проекта, сценарии, менеджер пакетов, серверы разработки, журналы, средства запуска задач, тестовые команды и любые существующие инструменты TUI. 3. Если желаемый Dock неоднозначен, спросите пользователя, что он хочет отслеживать или контролировать, прежде чем писать файлы. Док — это область управления терминалом на правой боковой панели UniConnect. Конфигурация Dock — JSON с массивом `controls` верхнего уровня. Каждый элемент управления запускает команду в своем собственном разделе терминала, поддерживаемом Ghostty, используя оболочку входа пользователя. Элементы управления полезны для панелей мониторинга проекта, представлений git/статуса, состояния сервера разработки или сборки, наблюдателей тестов, хвостов журналов, очередей, локальных служб или пользовательских TUI, таких как `cmux feed tui --opentui`, когда этот канал полезен. Выбираем куда писать конфиг: - В репозитории или каталоге проекта создайте или отредактируйте `.uniconnect/dock.json`, чтобы товарищи по команде могли поделиться им. - Для личного значения по умолчанию вне репозитория создайте или отредактируйте `~/.config/uniconnect/dock.json`. - Если оба существуют, проект `.uniconnect/dock.json` более специфичен для этого проекта. Конфигурации вложенных проектов применяются к этому дереву каталогов; используйте ближайшую соответствующую конфигурацию проекта вместо написания несвязанных элементов управления глобально. - Если нет репозитория и четкого проекта root, используйте глобальную конфигурацию только после подтверждения того, что пользователю нужен личный Dock. Схема: { "controls": [ { "id": "short-stable-id", "title": "Human label", "command": "safe command to run", "cwd": "optional/path", "height": 220, "env": { "NAME": "value" } } ] } Правила: - Сохраняйте идентификаторы стабильными, строчными и уникальными. - Используйте `cwd` для подкаталогов; относительные пути разрешаются из базы конфигурации. - Используйте `height` только в том случае, если элементу управления требуется фиксированный объем вертикального пространства. - Используйте `env` только для несекретных значений, необходимых для одного элемента управления. - Не помещайте секреты, токены или частные пути для конкретного компьютера в общую конфигурацию проекта. - Отдавайте предпочтение командам, которые можно безопасно запускать повторно и которые имеют смысл в терминале. - Не придумывайте недоступные сценарии. Сначала прочитайте файлы пакетов, файлы Makefile, Procfiles, README, файлы конфигурации и существующие инструменты. - Сохраняйте общие доки проекта портативными для коллег. Поместите персональные или машинные элементы управления в глобальную док-станцию. Результат: - Создайте или обновите соответствующий файл Dock.json. - Сохраните существующие полезные элементы управления, если пользователь не попросит их заменить. - Убедитесь, что JSON анализирует. - Кратко опишите, что делает каждый элемент управления, и любые команды, которые пользователь должен просмотреть, прежде чем доверять конфигурации Dock.
th: ตั้งค่า UniConnect Dock control สำหรับบริบทปัจจุบัน ขั้นแรก เรียนรู้คุณลักษณะนี้ก่อนที่จะแก้ไข: 1. เรียกใช้ `cmux docs dock` หาก cmux CLI พร้อมใช้งาน หากไม่ใช่ โปรดอ่าน https://github.com/Unixcision/uniconnect/blob/uniconnect/docs/UNICONNECT.md 2. ตรวจสอบพื้นที่เก็บข้อมูลหรือไดเรกทอรีปัจจุบันเพื่อทำความเข้าใจประเภทโปรเจ็กต์ สคริปต์ ตัวจัดการแพ็คเกจ เซิร์ฟเวอร์ dev บันทึก ตัวดำเนินการงาน คำสั่งทดสอบ และเครื่องมือ TUI ที่มีอยู่ 3. หาก Dock ที่ต้องการไม่ชัดเจน ให้ถามผู้ใช้ว่าต้องการตรวจสอบหรือควบคุมอะไรก่อนที่จะเขียนไฟล์ Dock คือพื้นที่ควบคุมเทอร์มินัลแถบด้านขวาของ UniConnect การกำหนดค่า Dock คือ JSON พร้อมด้วยอาร์เรย์ `controls` ระดับบนสุด การควบคุมแต่ละรายการจะรันคำสั่งในส่วนเทอร์มินัลที่ได้รับการสนับสนุนจาก Ghostty โดยใช้เชลล์ล็อกอินของผู้ใช้ การควบคุมมีประโยชน์สำหรับแดชบอร์ดโปรเจ็กต์ มุมมอง git/status เซิร์ฟเวอร์ dev หรือสถานะบิลด์ ผู้ตรวจสอบการทดสอบ ส่วนท้ายของบันทึก คิว บริการในพื้นที่ หรือ TUI แบบกำหนดเอง เช่น `cmux feed tui --opentui` เมื่อฟีดนั้นมีประโยชน์ เลือกตำแหน่งที่จะเขียนการกำหนดค่า: - ในพื้นที่เก็บข้อมูลหรือไดเรกทอรีโครงการ ให้สร้างหรือแก้ไข `.uniconnect/dock.json` เพื่อให้เพื่อนร่วมทีมสามารถแชร์ได้ - สำหรับค่าเริ่มต้นส่วนบุคคลภายนอก repo ให้สร้างหรือแก้ไข `~/.config/uniconnect/dock.json` - หากมีทั้งสองโครงการ `.uniconnect/dock.json` จะมีความเฉพาะเจาะจงมากขึ้นสำหรับโครงการนั้น การกำหนดค่าโปรเจ็กต์ที่ซ้อนกันจะนำไปใช้กับแผนผังไดเร็กทอรีนั้น ใช้การกำหนดค่าโครงการที่เกี่ยวข้องที่ใกล้ที่สุดแทนการเขียนการควบคุมที่ไม่เกี่ยวข้องทั่วโลก - หากไม่มี repo และไม่มีโปรเจ็กต์ที่ชัดเจน root ให้ใช้การกำหนดค่าส่วนกลางหลังจากยืนยันว่าผู้ใช้ต้องการ Dock ส่วนตัวเท่านั้น สคีมา: { "controls": [ { "id": "short-stable-id", "title": "Human label", "command": "safe command to run", "cwd": "optional/path", "height": 220, "env": { "NAME": "value" } } ] } กฎ: - รักษารหัสให้คงที่ ตัวพิมพ์เล็ก และไม่ซ้ำกัน - ใช้ `cwd` สำหรับไดเรกทอรีย่อย เส้นทางสัมพัทธ์แก้ไขได้จากฐานการกำหนดค่า - ใช้ `height` เฉพาะเมื่อตัวควบคุมต้องการพื้นที่แนวตั้งจำนวนคงที่ - ใช้ `env` เฉพาะสำหรับค่าที่ไม่เป็นความลับซึ่งจำเป็นโดยตัวควบคุมเดียวเท่านั้น - อย่าใส่ข้อมูลลับ โทเค็น หรือเส้นทางส่วนตัวเฉพาะเครื่องในการกำหนดค่าโปรเจ็กต์ที่แชร์ - ต้องการคำสั่งที่ปลอดภัยในการเริ่มซ้ำๆ และสมเหตุสมผลในเทอร์มินัล - อย่าสร้างสคริปต์ที่ไม่พร้อมใช้งาน อ่านไฟล์แพ็กเกจ, Makefiles, Procfiles, เอกสาร README, ไฟล์กำหนดค่า และเครื่องมือที่มีอยู่ก่อน - เก็บ Docks โปรเจ็กต์ที่แชร์ไว้พกพาสำหรับเพื่อนร่วมทีม ใส่การควบคุมส่วนบุคคลหรือเฉพาะเครื่องลงใน Dock ส่วนกลาง ส่งมอบได้: - สร้างหรืออัปเดต dock.json ที่เหมาะสม - รักษาการควบคุมที่เป็นประโยชน์ที่มีอยู่ เว้นแต่ผู้ใช้จะขอให้เปลี่ยนใหม่ - ตรวจสอบว่า JSON แยกวิเคราะห์ - สรุปสิ่งที่แต่ละการควบคุมทำและคำสั่งใดๆ ที่ผู้ใช้ควรตรวจสอบก่อนที่จะเชื่อถือการกำหนดค่า Dock
tr: Geçerli bağlam için UniConnect Dock denetimlerini ayarlayın. İlk olarak, düzenlemeden önce özelliği öğrenin: 1. `cmux docs dock` cmux CLI mevcutsa çalıştırın. Değilse https://github.com/Unixcision/uniconnect/blob/uniconnect/docs/UNICONNECT.md adresini okuyun 2. Proje türünü, komut dosyalarını, paket yöneticisini, geliştirme sunucularını, günlükleri, görev çalıştırıcılarını, test komutlarını ve mevcut TUI araçlarını anlamak için depoyu veya geçerli dizini inceleyin. 3. İstenilen Dock belirsizse, dosyaları yazmadan önce kullanıcıya neyin izlenmesini veya kontrol edilmesini istediğini sorun. Dock, UniConnect'ün sağ kenar çubuğu terminal kontrol alanıdır. Dock yapılandırması, üst düzey `controls` dizisine sahip JSON şeklindedir. Her kontrol, kullanıcının oturum açma kabuğunu kullanarak kendi Ghostty destekli terminal bölümünde bir komut çalıştırır. Kontroller, proje kontrol panelleri, git/status görünümleri, geliştirme sunucusu veya derleme durumu, test gözlemcileri, günlük kuyrukları, kuyruklar, yerel hizmetler veya `cmux feed tui --opentui` gibi özel bir TUI için bu feed yararlı olduğunda kullanışlıdır. Yapılandırmanın nereye yazılacağını seçin: - Ekip arkadaşlarınızın paylaşabilmesi için bir depoda veya proje dizininde `.uniconnect/dock.json` oluşturun veya düzenleyin. - Deponun dışında kişisel bir varsayılan için `~/.config/uniconnect/dock.json` oluşturun veya düzenleyin. - Her ikisi de mevcutsa, `.uniconnect/dock.json` projesi o proje için daha spesifiktir. İç içe proje yapılandırmaları bu dizin ağacına uygulanır; ilgisiz kontrolleri genel olarak yazmak yerine en yakın ilgili proje yapılandırmasını kullanın. - Repo yoksa ve net bir proje root yoksa, genel yapılandırmayı yalnızca kullanıcının kişisel bir Dock istediğini onayladıktan sonra kullanın. Şema: { "controls": [ { "id": "short-stable-id", "title": "Human label", "command": "safe command to run", "cwd": "optional/path", "height": 220, "env": { "NAME": "value" } } ] } Tüzük: - Kimlikleri sabit, küçük harfli ve benzersiz tutun. - Alt dizinler için `cwd` kullanın; göreceli yollar yapılandırma tabanından çözümlenir. - `height` adresini yalnızca bir denetim sabit miktarda dikey alana ihtiyaç duyduğunda kullanın. - Yalnızca bir denetimin ihtiyaç duyduğu gizli olmayan değerler için `env` kullanın. - Paylaşılan bir proje yapılandırmasına gizli diziler, belirteçler veya makineye özgü özel yollar koymayın. - Tekrar tekrar başlatılması güvenli olan ve bir terminalde anlamlı olan komutları tercih edin. - Kullanılamayan komut dosyalarını icat etmeyin. Önce paket dosyalarını, Makefile dosyalarını, Proc dosyalarını, README belgelerini, yapılandırma dosyalarını ve mevcut araçları okuyun. - Paylaşılan proje Dock'larını ekip arkadaşları için taşınabilir tutun. Kişisel veya makineye özel kontrolleri global Dock'a yerleştirin. teslim edilebilir: - Uygun dock.json dosyasını oluşturun veya güncelleyin. - Kullanıcı bunları değiştirmek istemediği sürece mevcut kullanışlı kontrolleri koruyun. - JSON'in ayrıştırıldığını doğrulayın. - Her kontrolün ne yaptığını ve kullanıcının Dock yapılandırmasına güvenmeden önce incelemesi gereken komutları özetleyin.
uk: Налаштуйте UniConnect елементи керування Dock для поточного контексту. По-перше, вивчіть функцію перед редагуванням: 1. Запустіть `cmux docs dock`, якщо cmux CLI доступний. Якщо ні, прочитайте https://github.com/Unixcision/uniconnect/blob/uniconnect/docs/UNICONNECT.md 2. Перевірте сховище або поточний каталог, щоб зрозуміти тип проекту, сценарії, менеджер пакунків, сервери розробників, журнали, програми виконання завдань, тестові команди та будь-які існуючі TUI інструменти. 3. Якщо потрібний Dock неоднозначний, запитайте користувача, що він хоче контролювати чи контролювати перед записом файлів. Док – це UniConnect область керування терміналом на правій бічній панелі. Конфігурація Dock – JSON із масивом `controls` верхнього рівня. Кожен елемент керування виконує команду у власному розділі терміналу, що підтримується Ghostty, використовуючи оболонку входу користувача. Елементи керування корисні для інформаційних панелей проекту, переглядів git/status, стану сервера розробників або збірки, спостерігачів за тестами, хвостів журналів, черг, локальних служб або спеціального TUI, наприклад `cmux feed tui --opentui`, коли цей канал корисний. Виберіть місце для запису конфігурації: - У сховищі чи каталозі проекту створіть або відредагуйте `.uniconnect/dock.json`, щоб члени команди могли ним поділитися. - Для персонального замовчування за межами репо створіть або відредагуйте `~/.config/uniconnect/dock.json`. - Якщо обидва існують, проект `.uniconnect/dock.json` є більш конкретним для цього проекту. Вкладені конфігурації проекту застосовуються до цього дерева каталогів; використовуйте найближчу відповідну конфігурацію проекту замість глобального написання непов’язаних елементів керування. - Якщо немає репозиторію та чіткого проекту root, використовуйте глобальну конфігурацію лише після того, як підтвердите, що користувач хоче особистий Dock. Схема: { "controls": [ { "id": "short-stable-id", "title": "Human label", "command": "safe command to run", "cwd": "optional/path", "height": 220, "env": { "NAME": "value" } } ] } правила: - Зберігайте ідентифікатори стабільними, малими та унікальними. - Використовуйте `cwd` для підкаталогів; відносні шляхи вирішуються з бази конфігурації. - Використовуйте `height` лише тоді, коли для елемента керування потрібен фіксований вертикальний простір. - Використовуйте `env` лише для несекретних значень, необхідних одному елементу керування. - Не додавайте секрети, маркери чи приватні шляхи, пов’язані з машиною, у спільну конфігурацію проекту. - Віддавайте перевагу командам, які безпечно запускати повторно та мають сенс у терміналі. - Не вигадуйте недоступних скриптів. Спочатку прочитайте файли пакунків, Makefiles, Procfiles, README документи, конфігураційні файли та наявні інструменти. - Зберігайте спільні доки проекту портативними для колег. Розмістіть персональні або специфічні елементи керування в глобальній панелі Dock. Доставка: - Створіть або оновіть відповідний файл dock.json. - Зберігайте існуючі корисні елементи керування, якщо користувач не попросить їх замінити. - Переконайтеся, що JSON аналізує. - Узагальніть, що робить кожен елемент керування, і будь-які команди, які користувач має переглянути, перш ніж довіряти конфігурації Dock.
zh_hans: 为当前上下文设置 UniConnect Dock 控件。 一、编辑前先了解一下功能: 1. 如果 cmux CLI 可用，请运行 `cmux docs dock`。如果不是，请阅读 https://github.com/Unixcision/uniconnect/blob/uniconnect/docs/UNICONNECT.md 2. 检查存储库或当前目录以了解项目类型、脚本、包管理器、开发服务器、日志、任务运行程序、测试命令以及任何现有的 TUI 工具。 3. 如果所需的 Dock 不明确，请在写入文件之前询问用户他们想要监视或控制什么。 Dock 是 UniConnect 的右侧边栏终端控制区域。 Dock 配置是 JSON ，具有顶级 `controls` 数组。每个控件都使用用户的登录 shell 在其自己的 Ghostty 支持的终端部分中运行命令。控件对于项目仪表板、git/status 视图、开发服务器或构建状态、测试观察程序、日志尾部、队列、本地服务或自定义 TUI（例如 `cmux feed tui --opentui`）（当该提要有用时）非常有用。 选择写入配置的位置: - 在存储库或项目目录中，创建或编辑 `.uniconnect/dock.json` 以便团队成员可以共享它。 - 对于存储库之外的个人默认值，请创建或编辑 `~/.config/uniconnect/dock.json`。 - 如果两者都存在，则项目 `.uniconnect/dock.json` 对该项目更具体。嵌套项目配置适用于该目录树；使用最近的相关项目配置，而不是全局编写不相关的控件。 - 如果没有 repo 并且没有明确的项目 root，只有在确认用户想要个人 Dock 后才使用全局配置。 模式: { "controls": [ { "id": "short-stable-id", "title": "Human label", "command": "safe command to run", "cwd": "optional/path", "height": 220, "env": { "NAME": "value" } } ] } 规则: - 保持 ids 稳定、小写且唯一。 - 使用 `cwd` 作为子目录；相对路径从配置库解析。 - 仅当控件需要固定的垂直空间时才使用 `height`。 - 仅对一个控件所需的非秘密值使用 `env`。 - 不要将机密、令牌或特定于计算机的私有路径放入共享项目配置中。 - 首选可安全重复启动且在终端中有意义的命令。 - 不要发明不可用的脚本。首先阅读包文件、Makefile、Procfile、README 文档、配置文件和现有工具。 - 保持共享项目 Dock 便于队友移植。将个人或机器特定的控件放入全局 Dock 中。 可交付成果: - 创建或更新适当的dock.json。 - 保留现有的有用控件，除非用户要求替换它们。 - 验证 JSON 是否已解析。 - 总结每个控件的作用以及用户在信任 Dock 配置之前应查看的所有命令。
zh_hant: 為目前上下文設定 UniConnect Dock 控制項。 一、編輯前先了解功能: 1. 如果 cmux CLI 可用，請執行 `cmux docs dock`。如果不是，請閱讀 https://github.com/Unixcision/uniconnect/blob/uniconnect/docs/UNICONNECT.md 2. 檢查儲存庫或目前目錄以了解專案類型、腳本、套件管理器、開發伺服器、日誌、任務執行程式、測試命令以及任何現有的 TUI 工具。 3. 如果所需的 Dock 不明確，請在寫入檔案之前詢問使用者想要監視或控制什麼。 Dock 是 UniConnect 的右側邊欄終端控制區域。 Dock 配置是 JSON ，具有頂級 `controls` 數組。每個控制項都使用使用者的登入 shell 在自己的 Ghostty 支援的終端部分中執行命令。控制項對於專案儀表板、git/status 視圖、開發伺服器或建置狀態、測試觀察程式、日誌尾部、佇列、本機服務或自訂 TUI（例如 `cmux feed tui --opentui`）（當此提要有用時）非常有用。 選擇寫入配置的位置: - 在儲存庫或專案目錄中，建立或編輯 `.uniconnect/dock.json` 以便團隊成員可以共用它。 - 對於儲存庫以外的個人預設值，請建立或編輯 `~/.config/uniconnect/dock.json`。 - 如果兩者都存在，則項目 `.uniconnect/dock.json` 對該項目更具體。巢狀項目配置適用於該目錄樹；使用最近的相關項目配置，而不是全域編寫不相關的控制項。 - 如果沒有 repo 且沒有明確的專案 root，只有在確認使用者想要個人 Dock 後才使用全域設定。 模式: { "controls": [ { "id": "short-stable-id", "title": "Human label", "command": "safe command to run", "cwd": "optional/path", "height": 220, "env": { "NAME": "value" } } ] } 規則: - 保持 ids 穩定、小寫且唯一。 - 使用 `cwd` 作為子目錄；相對路徑從組態庫解析。 - 僅當控制項需要固定的垂直空間時才使用 `height`。 - 僅對一個控制項所需的非秘密值使用 `env`。 - 請勿將機密、令牌或特定於電腦的私人路徑放入共享項目配置中。 - 首選可安全重複啟動且在終端機中有意義的命令。 - 不要發明不可用的腳本。首先閱讀套件檔案、Makefile、Procfile、README 文件、設定檔和現有工具。 - 保持共享項目 Dock 便於隊友移植。將個人或機器特定的控制項放入全域 Dock 中。 可交付成果: - 建立或更新適當的dock.json。 - 保留現有的有用控件，除非使用者要求替換它們。 - 驗證 JSON 是否已解析。 - 總結每個控制項的作用以及使用者在信任 Dock 配置之前應查看的所有命令。
